erp3l/src/Catalogs/ФиксированныеГруппыАналитик/ФиксированныеГруппыАналитик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФиксированныеГруппыАналитик</name>
  <predefined>
    <items>
      <name>ПереоценкаФИ_БалансоваяСтоимостьДоговоры</name>
      <description>Переоценка финансовых инструментов: Балансовая стоимость и количество (договоры)</description>
    </items>
    <items>
      <name>ПереоценкаФИ_БалансоваяСтоимостьЦБ</name>
      <description>Переоценка финансовых инструментов: Балансовая стоимость и количество (ценные бумаги)</description>
    </items>
    <items>
      <name>РезервыДЗ_ДвижениеРезервовНСБУ</name>
      <description>Резервы ДЗ: Движение резервов (НСБУ)</description>
    </items>
    <items>
      <name>РезервыДЗ_КорректировкиРезервовМСФО</name>
      <description>Резервы ДЗ: Корректировки резервов МСФО</description>
    </items>
    <items>
      <name>РезервыДЗ_НачислениеРезерваМСФО</name>
      <description>Резервы ДЗ: Начисление резерва МСФО</description>
    </items>
    <items>
      <name>РезервыМПЗ_ДвижениеРезервовНСБУ</name>
      <description>Резервы МПЗ: Движение резервов (НСБУ)</description>
    </items>
    <items>
      <name>РезервыМПЗ_НачислениеРезерваМСФО</name>
      <description>Резервы МПЗ: Начисление резерва МСФО</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОтчетаИсточник</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаАналитикИсточник</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФиксированныеАналитики</name>
    <attributes>
      <name>ИмяПриемника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПриемника</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
        <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриемникОбязателен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьИсточника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючОтбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОтбора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксированныеПоказатели</name>
    <attributes>
      <name>ИмяПриемника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПриемника</name>
      <type>
        <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательОтчетаИсточник</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриемникОбязателен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыАналитик</name>
    <attributes>
      <name>КлючОтбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Documents/НастраиваемыйОтчет/НастраиваемыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастраиваемыйОтчет</name>
  <basedOn>Catalog.БланкиОтчетов</basedOn>
  <basedOn>Catalog.ХранимыеФайлыОрганизаций</basedOn>
  <basedOn>Catalog.ВидыОтчетов</basedOn>
  <registerRecords>AccumulationRegister.ЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОтчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтениеНеактуальныхЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкИмпорта</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоПроверки</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСвертывания</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВноситьИзменения</name>
    <comment>Не вносить изменения в отчет при автоматической обработке</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уд_Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Уд_ДанныеРасчетов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечанияБланков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭкземплярыИсточники</name>
    <attributes>
      <name>ЭкземплярОтчета</name>
      <type>
        <types>DocumentRef.НастраиваемыйОтчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Catalogs/ФиксированныеГруппыАналитик/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбновитьГруппу(ОбъектГруппа, ОбновитьВидОтчета = Истина) Экспорт

	Если ОбъектГруппа.Предопределенный Тогда
		ОбновитьПредопределеннуюГруппуАналитик(ОбъектГруппа, ОбновитьВидОтчета);
	КонецЕсли;
	
	Если ОбъектГруппа.ВидОтчетаИсточник.Пустая() Тогда
	    ОбъектГруппа.ВидОтчетаИсточник = Справочники.ВидыОтчетов.ПолучитьВидОтчетаОСВ(Справочники.ПланыСчетовБД.ПолучитьПланСчетовБД("МСФО"));
	КонецЕсли;
	
	Если ОбъектГруппа.ГруппаАналитикИсточник.Пустая() Тогда
		ОбъектГруппа.ГруппаАналитикИсточник = Справочники.ГруппыРаскрытия.ПустаяСсылка();
	КонецЕсли;
		
КонецПроцедуры

Функция ГруппаЗаполнена(ФиксированнаяГруппа, ВыдаватьСообщенияОбОшибках = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Не заполнена группа раскрытия в фиксированной группе аналитик"" КАК СодержаниеОшибки,
	|	ФиксированныеГруппыАналитик.Ссылка КАК УточнениеОшибки
	|ИЗ
	|	Справочник.ФиксированныеГруппыАналитик КАК ФиксированныеГруппыАналитик
	|ГДЕ
	|	ФиксированныеГруппыАналитик.Ссылка = &ФиксированнаяГруппа
	|	И (ФиксированныеГруппыАналитик.ВидОтчетаИсточник = ЗНАЧЕНИЕ(Справочник.ВидыОтчетов.ПустаяСсылка)
	|			ИЛИ ФиксированныеГруппыАналитик.ГруппаАналитикИсточник = ЗНАЧЕНИЕ(Справочник.ГруппыРаскрытия.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""В фиксированной группе аналитик не заполнен источник обязательной аналитики"",
	|	ВЫРАЗИТЬ(ФиксированныеГруппыАналитик.ИмяПриемника КАК СТРОКА(100))
	|ИЗ
	|	Справочник.ФиксированныеГруппыАналитик.ФиксированныеАналитики КАК ФиксированныеГруппыАналитик
	|ГДЕ
	|	ФиксированныеГруппыАналитик.Ссылка = &ФиксированнаяГруппа
	|	И ФиксированныеГруппыАналитик.ПриемникОбязателен
	|	И (ФиксированныеГруппыАналитик.ТипПриемника = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|			ИЛИ (ВЫРАЗИТЬ(ФиксированныеГруппыАналитик.ПутьИсточника КАК СТРОКА(300))) = """")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""В фиксированной группе аналитик не заполнен источник обязательного показателя"",
	|	ВЫРАЗИТЬ(ФиксированныеГруппыАналитик.ИмяПриемника КАК СТРОКА(100))
	|ИЗ
	|	Справочник.ФиксированныеГруппыАналитик.ФиксированныеПоказатели КАК ФиксированныеГруппыАналитик
	|ГДЕ
	|	ФиксированныеГруппыАналитик.Ссылка = &ФиксированнаяГруппа
	|	И ФиксированныеГруппыАналитик.ПриемникОбязателен
	|	И ФиксированныеГруппыАналитик.ПоказательОтчетаИсточник = ЗНАЧЕНИЕ(Справочник.ПоказателиОтчетов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Не заполнена таблица аналитик для фиксированной группы аналитик"",
	|	&ФиксированнаяГруппа
	|ИЗ
	|	Справочник.ФиксированныеГруппыАналитик.ФиксированныеАналитики КАК ФиксированныеГруппыАналитик
	|ГДЕ
	|	ФиксированныеГруппыАналитик.Ссылка = &ФиксированнаяГруппа
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ФиксированныеГруппыАналитик.Ссылка) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Не заполнена таблица показателей для фиксированной группы аналитик"",
	|	&ФиксированнаяГруппа
	|ИЗ
	|	Справочник.ФиксированныеГруппыАналитик.ФиксированныеПоказатели КАК ФиксированныеГруппыАналитик
	|ГДЕ
	|	ФиксированныеГруппыАналитик.Ссылка = &ФиксированнаяГруппа
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ФиксированныеГруппыАналитик.Ссылка) = 0";
	
	Запрос.УстановитьПараметр("ФиксированнаяГруппа", ФиксированнаяГруппа);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ВыдаватьСообщенияОбОшибках = Ложь Тогда
	
		Возврат РезультатЗапроса.Пустой();
		
	Иначе
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Истина;
		Иначе
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбщегоНазначенияУХ.СообщитьОбОшибке(Выборка.СодержаниеОшибки + ": " + Выборка.УточнениеОшибки, , , СтатусСообщения.Информация);
			КонецЦикла;
			
			Возврат Ложь;
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеПредопределенных

Процедура ОбновитьПредопределеннуюГруппуАналитик(ОбъектГруппа, ОбновитьВидОтчета = Истина) Экспорт

	Макет = ПолучитьМакет("Макет_ru");
	ОбластьМакета = Макет.Области.Найти(ОбъектГруппа.ИмяПредопределенныхДанных);
	
	Если ОбластьМакета = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не найден макет заполнения предопределенного элемента:'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения + ОбъектГруппа.ИмяПредопределенныхДанных);
		Возврат;
	КонецЕсли;
	
	Для НомерСтроки = ОбластьМакета.Верх По ОбластьМакета.Низ Цикл
		
		Если ПолучитьБулево(Макет.Область(НомерСтроки,2).Текст) = Истина Тогда
			
			// Аналитика
			СтрокаТЧ = ПолучитьСтрокуТЧ(ОбъектГруппа.ФиксированныеАналитики, Макет.Область(НомерСтроки,1).Текст);
			СтрокаТЧ.ТипПриемника = ПолучитьТипПриемника(Макет.Область(НомерСтроки, 3).Текст);
			СтрокаТЧ.ПриемникОбязателен = ПолучитьБулево(Макет.Область(НомерСтроки,4).Текст);
			
		Иначе
			
			// Показатель
			СтрокаТЧ = ПолучитьСтрокуТЧ(ОбъектГруппа.ФиксированныеПоказатели, Макет.Область(НомерСтроки,1).Текст);
			СтрокаТЧ.ТипПриемника = ОбщегоНазначенияУХ.ПолучитьЗначениеПеречисленияПоИмени("ТипыЗначенийПоказателейОтчетов", Макет.Область(НомерСтроки,3).Текст);
			СтрокаТЧ.ПриемникОбязателен = ПолучитьБулево(Макет.Область(НомерСтроки,4).Текст);
			
		КонецЕсли; 	
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьСоотвествиеАналитик(ГруппаАналитикИсточник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГруппыРаскрытия.ВидАналитики1,
	|	ГруппыРаскрытия.ВидАналитики2,
	|	ГруппыРаскрытия.ВидАналитики3,
	|	ГруппыРаскрытия.ВидАналитики4,
	|	ГруппыРаскрытия.ВидАналитики5,
	|	ГруппыРаскрытия.ВидАналитики6
	|ИЗ
	|	Справочник.ГруппыРаскрытия КАК ГруппыРаскрытия
	|ГДЕ
	|	ГруппыРаскрытия.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ГруппаАналитикИсточник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	АналитикиРаскрытия = Новый Соответствие;
	
	Для НомерАналитики = 1 По 6 Цикл
		АналитикиРаскрытия.Вставить(НомерАналитики, Выборка["ВидАналитики"+НомерАналитики]);
	КонецЦикла;

	Возврат АналитикиРаскрытия;
	
КонецФункции

Функция ПолучитьБулево(ТекстЯчейки)
	Возврат ?(ТекстЯчейки = "Истина", Истина, Ложь);
КонецФункции

Функция ПолучитьТипПриемника(ТекстЯчейки)

	Если СтрНайти("ЧислоСтрокаДатаБулево", ТекстЯчейки) > 0 Тогда
		
		Попытка
			Возврат Перечисления.ТипыЗначенийПоказателейОтчетов[ТекстЯчейки];		
		Исключение		
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		РезультатЗначение = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные[ТекстЯчейки];
	Исключение
		РезультатЗначение = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка();
	КонецПопытки;
	
	Возврат РезультатЗначение;

КонецФункции

Функция ПолучитьСтрокуТЧ(ТЧ, ИмяПриемника)

	СтрокаТЧ = ТЧ.Найти(ИмяПриемника, "ИмяПриемника");
	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = ТЧ.Добавить();
		СтрокаТЧ.ИмяПриемника = ИмяПриемника;
	КонецЕсли;

	Возврат СтрокаТЧ;
	
КонецФункции

#КонецОбласти

Функция ПолучитьПараметрыЗаполнения(ФиксированнаяГруппаАналитик) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФиксированныеГруппыАналитикФиксированныеАналитики.Ссылка КАК ГруппаАналитик,
	|	ФиксированныеГруппыАналитикФиксированныеАналитики.Ссылка.ВидОтчетаИсточник.Код КАК КодВидаОтчета,
	|	ФиксированныеГруппыАналитикФиксированныеАналитики.ИмяПриемника КАК ИмяПриемника,
	|	ВЫРАЗИТЬ(ФиксированныеГруппыАналитикФиксированныеАналитики.ПутьИсточника КАК СТРОКА(300)) КАК Источник,
	|	ИСТИНА КАК Аналитика,
	|	ФиксированныеГруппыАналитикФиксированныеАналитики.КлючОтбора,
	|	NULL КАК Поле1,
	|	ФиксированныеГруппыАналитикФиксированныеАналитики.ТипПриемника
	|ИЗ
	|	Справочник.ФиксированныеГруппыАналитик.ФиксированныеАналитики КАК ФиксированныеГруппыАналитикФиксированныеАналитики
	|ГДЕ
	|	ФиксированныеГруппыАналитикФиксированныеАналитики.Ссылка В(&Ссылка)
	|	И (ВЫРАЗИТЬ(ФиксированныеГруппыАналитикФиксированныеАналитики.ПутьИсточника КАК СТРОКА(300))) <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФиксированныеГруппыАналитикФиксированныеПоказатели.Ссылка,
	|	ФиксированныеГруппыАналитикФиксированныеПоказатели.Ссылка.ВидОтчетаИсточник.Код,
	|	ФиксированныеГруппыАналитикФиксированныеПоказатели.ИмяПриемника,
	|	ФиксированныеГруппыАналитикФиксированныеПоказатели.ПоказательОтчетаИсточник,
	|	ЛОЖЬ,
	|	NULL,
	|	0,
	|	ФиксированныеГруппыАналитикФиксированныеПоказатели.ТипПриемника
	|ИЗ
	|	Справочник.ФиксированныеГруппыАналитик.ФиксированныеПоказатели КАК ФиксированныеГруппыАналитикФиксированныеПоказатели
	|ГДЕ
	|	ФиксированныеГруппыАналитикФиксированныеПоказатели.Ссылка В(&Ссылка)
	|	И ФиксированныеГруппыАналитикФиксированныеПоказатели.ПоказательОтчетаИсточник <> ЗНАЧЕНИЕ(Справочник.ПоказателиОтчетов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ФиксированнаяГруппаАналитик);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьГруппыПриемника(ТипПриемник) Экспорт

	ФиксированныеГруппы = Новый Массив;
	
	Если ТипПриемник = Тип("ДокументСсылка.РезервыПоЗапасам") Тогда
		
		ФиксированныеГруппы.Добавить(РезервыМПЗ_НачислениеРезерваМСФО);
		ФиксированныеГруппы.Добавить(РезервыМПЗ_ДвижениеРезервовНСБУ);		
		
	ИначеЕсли ТипПриемник = Тип("ДокументСсылка.РезервыПоДЗИАвансамВыданным") Тогда
		
		ФиксированныеГруппы.Добавить(РезервыДЗ_НачислениеРезерваМСФО);
		ФиксированныеГруппы.Добавить(РезервыДЗ_ДвижениеРезервовНСБУ);
		ФиксированныеГруппы.Добавить(РезервыДЗ_КорректировкиРезервовМСФО);
				
	ИначеЕсли ТипПриемник = Тип("ДокументСсылка.ПереоценкаФинансовыхИнструментов") Тогда
		
		ФиксированныеГруппы.Добавить(ПереоценкаФИ_БалансоваяСтоимостьДоговоры);
		ФиксированныеГруппы.Добавить(ПереоценкаФИ_БалансоваяСтоимостьЦБ);
						
	КонецЕсли;
	
	Возврат ФиксированныеГруппы; 

КонецФункции

Функция ПолучитьРасшифровкуПоПриемнику(Приемник) Экспорт

	ФиксированныеГруппы = ПолучитьГруппыПриемника(ТипЗнч(Приемник));
	
	Расшифровки = Новый Массив;
	КэшРасшифровок = Новый Соответствие;
	
	ТабОтчеты = ПолучитьЭкземплярыПоГруппам(ФиксированныеГруппы, Приемник.Сценарий, Приемник.Организация, Приемник.ПериодОтчета); 
	
	Для каждого ФиксированнаяГруппа Из ФиксированныеГруппы Цикл
	
		СтрокаТаб = ТабОтчеты.Найти(ФиксированнаяГруппа.ВидОтчетаИсточник, "ВидОтчета");
		Если СтрокаТаб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПоказателей = КэшРасшифровок.Получить(СтрокаТаб.Отчет);
				
		Если МассивПоказателей = Неопределено Тогда		
			МассивПоказателей = Новый Массив;		
		КонецЕсли;		
		
		Для каждого СтрокаПоказатель Из ФиксированнаяГруппа.ФиксированныеПоказатели Цикл
			МассивПоказателей.Добавить(СокрЛП(СтрокаПоказатель.ПоказательОтчетаИсточник.Код));	
		КонецЦикла;		
		
		КэшРасшифровок.Вставить(СтрокаТаб.Отчет, МассивПоказателей);
		
	КонецЦикла;
	
	Для каждого ЭлементКэша Из КэшРасшифровок Цикл		
		Расшифровки.Добавить(Новый Структура("Ключ,МассивПоказателей", ЭлементКэша.Ключ, Новый ФиксированныйМассив(ЭлементКэша.Значение)));	
	КонецЦикла;
	
	Возврат Расшифровки;

КонецФункции

Функция ПолучитьЭкземплярыПоГруппам(ФиксированныеГруппы, Сценарий, Организация, ПериодОтчета)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастраиваемыйОтчет.Ссылка КАК Отчет,
	|	НастраиваемыйОтчет.ВидОтчета КАК ВидОтчета
	|ИЗ
	|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
	|ГДЕ
	|	НастраиваемыйОтчет.Организация = &Организация
	|	И НастраиваемыйОтчет.ПериодОтчета = &ПериодОтчета
	|	И НастраиваемыйОтчет.Сценарий = &Сценарий
	|	И НастраиваемыйОтчет.ВидОтчета В
	|			(ВЫБРАТЬ
	|				т.ВидОтчетаИсточник
	|			ИЗ
	|				Справочник.ФиксированныеГруппыАналитик КАК т
	|			ГДЕ
	|				т.Ссылка В (&ФиксированныеГруппы))");
	
	Запрос.УстановитьПараметр("ФиксированныеГруппы",	ФиксированныеГруппы);
	Запрос.УстановитьПараметр("Сценарий", 				Сценарий);
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("ПериодОтчета", 			ПериодОтчета);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ПолучитьОписаниеТаблицы(ФиксированныеГруппы) Экспорт

	КолонкиТаблицы = Новый СписокЗначений;
	ИменаКолонок = Новый Структура;
	Для каждого ТекСтрока Из ФиксированныеГруппы.ФиксированныеАналитики Цикл
		
		ТипКолонки = Тип("Строка");
		Если ТипЗнч(ТекСтрока.ТипПриемника) = Тип("ПланВидовХарактеристикСсылка.ВидыСубконтоКорпоративные") Тогда
			ТипКолонки = ТекСтрока.ТипПриемника.ТипЗначения;
		ИначеЕсли ТипЗнч(ТекСтрока.ТипПриемника) = Тип("ПеречислениеСсылка.ТипыЗначенийПоказателейОтчетов") Тогда	
			
			Если ТекСтрока.ТипПриемника = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
				ТипКолонки = ОбщегоНазначения.ОписаниеТипаЧисло(18, 2);
			ИначеЕсли ТекСтрока.ТипПриемника = Перечисления.ТипыЗначенийПоказателейОтчетов.Дата Тогда
				ТипКолонки = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
			ИначеЕсли ТекСтрока.ТипПриемника = Перечисления.ТипыЗначенийПоказателейОтчетов.Булево Тогда
				ТипКолонки = Новый ОписаниеТипов("Булево");
			Иначе 
				ТипКолонки = ОбщегоНазначения.ОписаниеТипаСтрока(0);
			КонецЕсли;
			
		КонецЕсли;
		КолонкиТаблицы.Добавить(ТипКолонки, ТекСтрока.ИмяПриемника);
		ИменаКолонок.Вставить(ТекСтрока.ИмяПриемника);
	КонецЦикла;
	
	Для каждого ТекСтрока Из ФиксированныеГруппы.ФиксированныеПоказатели Цикл
		
		Если ИменаКолонок.Свойство(ТекСтрока.ИмяПриемника) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипКолонки = Тип("Строка");
		Если ТипЗнч(ТекСтрока.ТипПриемника) = Тип("ПланВидовХарактеристикСсылка.ВидыСубконтоКорпоративные") Тогда
			ТипКолонки = ТекСтрока.ТипПриемника.ТипЗначения;
		ИначеЕсли ТипЗнч(ТекСтрока.ТипПриемника) = Тип("ПеречислениеСсылка.ТипыЗначенийПоказателейОтчетов") Тогда	
			ТипКолонки = ОбщегоНазначения.ОписаниеТипаСтрока(0);
		КонецЕсли;
		КолонкиТаблицы.Добавить(ТипКолонки, ТекСтрока.ИмяПриемника);
		
		ИменаКолонок.Вставить(ТекСтрока.ИмяПриемника);
		
	КонецЦикла;
	
	Возврат КолонкиТаблицы;	

КонецФункции

#КонецЕсли
